# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка, выровненного по правой стороне.
# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз
# Подсказка: воспользоваться методом .format()

print("ЗАДАЧА №1 ===================================================\n")

fruits = ["яблоко", "банан", "киви", "арбуз", "груша"]

i = 1
for fruit in fruits:
	print(str(i) + ".{:>7}".format(fruit))
	i += 1


# =============================================================================================
# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

print("\nЗАДАЧА №2 =================================================\n")

list1 = ["слово1", "слово22", "слово111", "слово2222", "слово11111"]
list2 = ["слово2", "слово22", "слово222", "слово2222", "слово22222", "слово222222"]

print(f"Оригинальные списки:\n{list1}\n{list2}\n")

for word1 in list1:
	if word1 in list2:
		list1.remove(word1)
		print(f"Удален элемент {word1}.")

print(f"\nСписки, после удаления повторяющихся элементов:\n{list1}\n{list2}")


# =============================================================================================
# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

print("\nЗАДАЧА №3 =================================================\n")

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
new_list = []

for num in numbers:
	if (num % 2) == 0:
		new_list.append(num / 4)
	else:
		new_list.append(num * 2)

print(f"Оригинальный список из целых чисел: {numbers}")
print(f"Представляем НОВЫЙ список элементов: {new_list}")

